#include <iostream>
#include "language.h"
приглуши_хуйню_нахуй


не_трогать число стенкаХа это 10 бля
не_трогать число стенкаУа это 10 бля
символ лабиринт[стенкаХа][стенкаУа] бля
число осьХа это ноль бля
число осьУа это ноль бля

символ создатьХуйню скобка число хуета то
пошёл
	если хуета меньше 10 то верни стенку бля
	иначе верни ' ' бля
нахуй
нихуя рисуйЛабиринт скобка то
пошёл
пройдись число Число1 это ноль бля Число1 меньше стенкаХа бля Число1 увеличь то
пошёл
	пройдись число Число2 это ноль бля Число2 меньше стенкаУа бля Число2 увеличь то
	пошёл
	слышь " " еще лабиринт[Число1][Число2] бля
	нахуй
	слышь "" заткнись
нахуй
нахуй
число main скобка то
пошёл
	факт играПродолжаеться это пиздато бля
	пройдись число Число1 это ноль бля Число1 меньше стенкаХа бля Число1 увеличь то
	пошёл
		пройдись число Число2 это ноль бля Число2 меньше стенкаУа бля Число2 увеличь то
		пошёл
			лабиринт[Число1][Число2] это создатьХуйню скобка пиздни_циферку % 30 то бля
		нахуй
	нахуй
	пока играПродолжаеться то
		пошёл
			рисуйЛабиринт скобка то бля 
			число сук это ноль бля
			попизди	сук бля
		нахуй
	верни ноль бля
нахуй
